{
  "main": {
    "name":"Stephen Hendrix",
    "occupation":"Full-Stack Developer",
    "description":"Full-Stack Developer with a passion for problem-solving and collaboration",
    "image":"profilepic.jpg",
    "bio":"After completing SMU's coding boot camp, I was immediately asked to come back as a Teaching Assistant because of my passion for problem-solving and ability to learn new technologies quickly. Teaching others gave me a chance to sharpen my own understanding - in order to communicate effectively, I had to make sure that my own ideas were clear (something that I learned quickly during my time as a classroom teacher). I'm currently employed as a full-stack developer, and have taken on some contract work during my journey. I've been fortunate enough to work on a variety of projects involving a variety of technology; the desire to learn is my primary motivation, especially when I get to do it alongside a great team.",
    "contactmessage":"I hope you'll get in touch to let me know about any exciting or interesting opportunities (as soon as this button is working!).",
    "email": "StephenTHendrix@gmail.com",
    "phone": "(469) 644-3598",
    "address":{
      "city":"Dallas",
      "state":"Texas"
    },
    "website": "http://www.StephenTHendrix.com",
    "resumedownload":"https://drive.google.com/open?id=1hLvo_MJjaCJwYg2ILPK23SA3ZjYuNiuD",
    "social":[
      {
        "name":"linkedin",
        "url":"https://linkedin.com/in/stephenthendrix",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/StephenTHendrix",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"I've been involved in education because of my love of learning; it's prepared me well to work with a team and to stay curious about new technology.",
    "education":[
      {
        "school":"SMU",
        "degree":"Certificate in Full-Stack Web Development",
        "graduated":"December 2019",
        "description":"Earned an A+ in a rigorous curriculum that covers a full stack: HTML5, CSS3, JavaScript, jQuery, Node.js, Java, Express.js, React.js, Database Theory, MongoDB, MySQL, Command Line, Git, and more. Gained experience working in group projects with personal contributions in each of these technologies." 
      },
      {
        "school":"St. John's College",
        "degree":"B.A. History of Western Mathematics and Science; Philosophy. Minors in Comparative Literature and Linguistics",
        "graduated":"May 2015",
        "description":"A Great Books school where classes are small and lessons are student-led discussions. Whether translating Aristotle or proving Einstein's most famous equations, we learned by reading primary sources and working together to build a deep understanding of fundamental ideas."
      }
    ],
    "work":[
      {
        "company":"Event Dynamic",
        "title":"Full-Stack Developer",
        "years":"April 2020 - Present",
        "description":"At Event Dynamic I'm part of an impressive team that collaborates closely. I've become accustomed to working on assigned tasks in Jira, while communicating with others to reduce redundancy and optimize performance. I've helped with aspects of the front and back ends, from making reusable components and configuring redux stores to creating endpoints in Java."
      },
      {
        "company":"Cake",
        "title":"Lead Full-Stack Developer",
        "years":"April 2020 - Present",
        "description":"As the tech lead, I have a hand in every aspect of development, from the front and back ends to hosting and security. Our current and main project makes use of the MERN stack and is hosted through Heroku. I work closely with the supervisor and partners to ensure that our design and functionality remains impeccable, which I think of as a reflection of the code itself."
      },
      {
        "company":"Southern Methodist University",
        "title":"Full-Stack Web Development Teaching Assistant",
        "years":"January 2020 - Present",
        "description":"Teach students concept in coding, including Git, GitHub, HTML5, CSS3, Javascript, JQuery, Bootstrap, Firebase, Heroku, Node Js, MySQL, MongoDB, Express, Handelbars.js, ReactJS, and object-oriented programming. Encourage and model best practices and a problem-solving mindset."
      }
    ],
    "skills":[
      {
        "name":"ReactJS",
        "level":"85%"
      },
      {
        "name":"mySQL",
        "level":"70%"
      },
      {
        "name":"MongoDB",
        "level":"70%"
      },
      {
        "name":"Express.js",
        "level":"75%"
      },
      {
        "name":"Node.js",
        "level":"70%"
      },
      {
        "name":"HTML5",
        "level":"90%"
      },
      {
        "name":"CSS",
        "level":"85%"
      },
      {
        "name":"Javascript",
        "level":"85%"
      },
      {
        "name":"Git",
        "level":"80%"
      },
      {
        "name":"AJAX",
        "level":"75%"
      },
      {
        "name":"Heroku",
        "level":"80%"
      },
      {
        "name":"Firebase",
        "level":"70%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Marvel Personalities",
        "category":"A way to generate your favorite Marvel superhero personality Big 5 personality profiles. Powered by IBM Watson and Marvel APIs",
        "image":"Marvel.png",
        "url":"https://stephenthendrix.github.io/group-project/"
      },
      {
        "title":"Quirk",
        "category":"A project management tool that allows users to assign boards and tasks to one another. Full-stack application with user authentication.",
        "image":"Quirk.png",
        "url":"https://project-two-0.herokuapp.com/"
      },
      {
        "title":"Neighborly",
        "category":"A way for volunteers and those in need of volunteers to connect quickly.",
        "image":"Neighborly.png",
        "url":"https://myneighborly.herokuapp.com/"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"The Dallas Area Rape Crisis Center website does not currently have any developers or web support on staff. Stephen donated his time and expertise to us to help fix a few bugs we were experiencing in the site recently. His knowledge of development leads him to quickly solve any issues. Stephen kindly did this work for us onsite so that we could be a part of the process. He taught us some tips and tricks to help solve future issues. Working with him was a great experience and we truly appreciate his skill and patience. Thanks Stephen!",
        "user":"Janelle Gettmann, Dallas Rape Crisis Center"
      }
    ]
  }
}
