{
  "main": {
    "name":"Stephen Hendrix",
    "occupation":"Full-Stack Web Development Teaching Assistant",
    "description":"Full-Stack Developer with a passion for problem-solving and collaboration",
    "image":"profilepic.jpg",
    "bio":"As a web development teaching assistant, I help my students develop a problem-solving mindset: I encourage them to accomplish one small task at a time, and gradually build to a fully functioning application. This involves analyzing a problem and understanding it as smaller problems, a skill which I developed while pursuing a major in the History of Western Mathematics and Science, and modeled for the last 6 years as a teacher and tutor. Writing elegant code independently is exhilarating, but being able to share the process with a team is an experience I plan to chase for a long time.",
    "contactmessage":"I hope you'll get in touch to let me know about any exciting or interesting opportunities (as soon as this button is working!).",
    "email": "StephenTHendrix@gmail.com",
    "phone": "(469) 644-3598",
    "address":{
      "city":"Dallas",
      "state":"Texas"
    },
    "website": "http://www.StephenTHendrix.com",
    "resumedownload":"https://drive.google.com/file/d/1EikzR1MDwsFvckgV40z2D2g01v4lPcGQ/view?usp=sharing",
    "social":[
      {
        "name":"linkedin",
        "url":"https://linkedin.com/in/stephenthendrix",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/StephenTHendrix",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"I've been involved in education because of my love of learning; it's prepared me well to work with a team and to stay curious about new technology.",
    "education":[
      {
        "school":"SMU",
        "degree":"Certificate in Full-Stack Web Development",
        "graduated":"December 2019",
        "description":"Earned an A+ in a rigorous curriculum that covers a full stack: HTML5, CSS3, JavaScript, jQuery, Node.js, Java, Express.js, React.js, Database Theory, MongoDB, MySQL, Command Line, Git, and more. Gained experience working in group projects with personal contributions in each of these technologies." 
      },
      {
        "school":"St. John's College",
        "degree":"B.A. History of Western Mathematics and Science; Philosophy. Minors in Comparative Literature and Linguistics",
        "graduated":"May 2015",
        "description":"A Great Books school where classes are small and lessons are student-led discussions. Whether translating Aristotle or proving Einstein's most famous equations, we learned by reading primary sources and working together to build a deep understanding of fundamental ideas."
      }
    ],
    "work":[
      {
        "company":"Southern Methodist University",
        "title":"Full-Stack Web Development Teaching Assistant",
        "years":"January 2020 - Present",
        "description":"Teach students concept in coding, including Git, GitHub, HTML5, CSS3, Javascript, JQuery, Bootstrap, Firebase, Heroku, Node Js, MySQL, MongoDB, Express, Handelbars.js, ReactJS, and object-oriented programming. Encourage and model best practices and a problem-solving mindset."
      },
      {
        "company":"Victory Step Education",
        "title":"SAT/ACT Tutor",
        "years":"August 2019 - Present",
        "description":"Provide academic and organizational support to students preparing for SAT, ACT, or regular coursework. Students passed AP tests, raised class grades and standardized test scores. Track student progress and employ appropriate interventions to raise scores and grades. Maintain energy and optimism throughout session; be student's cheerleader. Coordinate schedules with parents."
      }
    ],
    "skills":[
      {
        "name":"ReactJS",
        "level":"75%"
      },
      {
        "name":"mySQL",
        "level":"70%"
      },
      {
        "name":"MongoDB",
        "level":"70%"
      },
      {
        "name":"Express.js",
        "level":"75%"
      },
      {
        "name":"Node.js",
        "level":"70%"
      },
      {
        "name":"HTML5",
        "level":"90%"
      },
      {
        "name":"CSS",
        "level":"80%"
      },
      {
        "name":"Javascript",
        "level":"85%"
      },
      {
        "name":"Git",
        "level":"70%"
      },
      {
        "name":"AJAX",
        "level":"75%"
      },
      {
        "name":"Heroku",
        "level":"80%"
      },
      {
        "name":"Firebase",
        "level":"70%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Marvel Personalities",
        "category":"A way to generate your favorite Marvel superhero personality Big 5 personality profiles. Powered by IBM Watson and Marvel APIs",
        "image":"Marvel.png",
        "url":"https://stephenthendrix.github.io/group-project/"
      },
      {
        "title":"Quirk",
        "category":"A project management tool that allows users to assign boards and tasks to one another. Full-stack application with user authentication.",
        "image":"Quirk.png",
        "url":"https://project-two-0.herokuapp.com/"
      },
      {
        "title":"Neighborly",
        "category":"A way for volunteers and those in need of volunteers to connect quickly.",
        "image":"Neighborly.png",
        "url":"https://myneighborly.herokuapp.com/"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"Very Knowledgeable And Knows Where to Start Immediately! To see our son actually understand geometry on his first visit with Stephen was very gratifying. He was nervous about sharing what he didn't know about geometry and having to talk with a 'stranger' about his weaknesses. But Stephen came in, starting talking like he knew our son and starting working on geometry to where our son understood. Our son asked questions and wasn't afraid to try an answer and get it wrong. Stephen made him feel very comfortable. After Stephen left, our son felt so good about himself, we heard him say, 'YESSSSSS!!!! I got it', as he went to his room. Thank you, Stephen. Look forward to the next session.",
        "user":"Lisa, Wyzant"
      },
      {
        "text":"Great teacher! Stephen H. is great! Took the time to see how best to explain things to my son Marcus and did so thoroughly and effectively. Marcus got out of his first session with Stephen saying that for the first time geometry was making sense to him! We will definitely be booking again. I highly recommend Stephen.",
        "user":"Kathryn, Wyzant"
      }
    ]
  }
}
